sl45sms/esp32c6-Keyword-Spotting/sdkconfig.defaults
#
# Default config
#
CONFIG_IDF_TARGET_ARCH_RISCV=y
CONFIG_IDF_TARGET_ARCH="riscv"
CONFIG_IDF_TARGET="esp32c6"
CONFIG_IDF_TARGET_ESP32C6=y
CONFIG_IDF_FIRMWARE_CHIP_ID=0x000D
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=y
#
# Audio HAL
#
CONFIG_ESP32_C6_DEVKIT_BOARD=y

